{
  "5cf5805fb53e011a64671582": {
    "summary": "When the eccentric hobbit Bilbo Baggins leaves his home in the Shire, he gives his greatest treasure to his heir Frodo: a magic ring that makes its wearer invisible. Because of the difficulty Bilbo has in giving the ring away, his friend the wizard Gandalf the Grey suspects that the ring is more than it appears. Some years later, Gandalf reveals to Frodo that the ring is in fact the One Ring, forged by Sauron the Dark Lord thousands of years before to enable him to dominate and enslave all of Middle-earth. Gandalf tells Frodo that the Ring must be destroyed to defeat Sauron's evil, but he also warns him that the Enemy has learned of the Ring's whereabouts from the creature Gollum and will seek to find it and kill its bearer. Despite the danger and hopelessness of the quest, Frodo accepts the burden and resolves to take the Ring to the safety of the elven stronghold of Rivendell.\r\n\r\nFrodo sets off with three companions, fellow hobbits Merry, Pippin, and Sam. After a series of close calls and misadventures, where they are saved only by the timely intervention of the mysterious Tom Bombadil, they reach the town of Bree. The innkeeper delivers a letter from Gandalf recommending a weather-beaten Ranger known as Strider as their guide to the elves. Strider leads them cross-country, hoping to avoid the Black Riders who are watching the Road, but they are attacked near the ancient watchtower of Weathertop. Frodo puts on the Ring, revealing himself to the Black Riders. Their leader stabs him with a blade of evil enchantment, and he nearly dies as they race for Rivendell. The Nine Riders try to force Frodo's surrender, but a flood destroys their horses even as Frodo collapses into unconsciousness.\r\n\r\nFrodo wakes in Rivendell, where the wise Elrond has worked his healing magic to save the hobbit. Frodo discovers that Bilbo, now grown very old, lives with the elves, and they reunite happily. Soon Elrond calls a council of the representatives of elves, men, and dwarves to respond to the growing darkness in the world. The council reviews the history of the Ring from its forging to the recent discovery that Frodo's ring is the One. Although Boromir, the representative of Gondor, the greatest kingdom of men, argues that the Ring should be used as a weapon against the Enemy, the Council resolves to destroy it. Someone must throw the Ring into the fires of Mount Doom, where it was first created, deep in Mordor, Sauron's country. Frodo accepts the task of carrying the Ring to Mordor, and a company is selected to help him on the quest: the wizard Gandalf; the men Boromir and Aragorn (known to Frodo as Strider but in fact the true king of Gondor); Legolas the elf; Gimli the dwarf; and Frodo's own hobbit kin, Merry, Pippin, and Sam. They are called the Fellowship of the Ring.\r\n\r\nThe company considers several paths through the mountains, but the ways are all watched. Even if they did not have Sauron to fear, Saruman the White, once the wisest of the wizards, has allied himself with the Enemy and seeks the Ring for himself. When they attempt to cross the pass of Caradhras, an unnatural snowstorm nearly buries them, and they are forced to turn back. Finally, they resolve to brave the perilous dwarven Mines of Moria, now overrun by orcs and even darker things. Within Moria, Gollum begins following them. When the nine have nearly found their way out, they are attacked by orcs and a Balrog, a terrible demon. Gandalf holds it back so that the party can escape, but then he falls with it into the abyss.\r\n\r\nDevastated by the loss of Gandalf, the Fellowship flees to the elven wood of Lothlórien. Lady Galadriel shelters them for a while and offers wise counsel. Frodo offers the Ring to Galadriel, but she resists the temptation. When the Fellowship leaves, she gives them boats to continue their journey down the river Anduin as well as more powerful gifts. Orcs attack them while traveling downriver, and they feel the presence of a winged Black Rider overhead, but they make it to the lawn of Parth Galen unharmed. There, they must decide whether to turn for Mordor and Mount Doom or to go to Minas Tirith, Boromir's home in Gondor. Boromir tries to force the issue by seizing the Ring from Frodo, but the hobbit escapes. Frodo resolves to set out alone for Mordor, reluctantly accepting Sam's steadfast refusal to stay behind."
  },
  "5cf58077b53e011a64671583": {
    "summary": "As Frodo and Sam leave, a band of orcs captures Merry and Pippin and kills Boromir. Aragorn, Legolas, and Gimli decide to let the Ringbearer go and instead rescue Merry and Pippin. Aragorn, Legolas, and Gimli pursue the orcs as they run across the fields of Rohan toward Saruman's fortress at Isengard. They find evidence that the orcs of Sauron and Saruman have quarreled and that either one hobbit is still alive, but they begin to lose hope as they fall farther and farther behind. After three days of running with little rest, they meet a troop of the riders of Rohan. The horsemen's leader, Éomer, informs the trio that the orcs were destroyed on the edge of Fangorn forest, with no survivors. He lends them horses to continue the pursuit, but offers little hope that the hobbits escaped the battle.\nAlthough treated roughly by the orcs, Merry and Pippin remain unharmed. When the Rohirrim attack, the hobbits run to the safety of the forest. They eventually make their way through the dense woodland to a stony hill where they meet Treebeard the Ent. This ancient being looks like a walking and talking tree and is the guardian of the forest. He does not particularly care about Sauron, but he takes the threat of Saruman very seriously. The wizard once cared for the forest and learned much from Treebeard, but now he chops down the trees to fuel the war machines of Isengard. Treebeard calls an Entmoot, a meeting of many Ents who decide to fight Saruman.\nAragorn, Legolas, and Gimli find the remains of the orcs at the edge of Fangorn and follow the hobbits' tracks into the forest. They meet a white-robed wizard under the trees whom they at first take to be Saruman, but he reveals himself as Gandalf returned. When he fell in Moria he continued to fight the Balrog and eventually overcame him. The ordeal changed him, and he has returned in white to signify that he is now the head of the wizard's council. Gandalf takes the three remaining members of the Fellowship to Edoras, Rohan's capital, to counter the evil influence of Saruman. King Théoden has listened to the evil counsels of Wormtongue, Saruman's spy, succumbing to old age and despair. Gandalf rouses him from his stupor and reveals Wormtongue's treachery. Éowyn, Théoden's niece and Éomer's sister, admires Aragorn. Théoden then musters his army and leads them to the fortress of Helm's Deep. The Rohirrim defeat Saruman's enormous army, although they suffer many losses. Unexpectedly, a great forest of trees appears in the valley and destroys all the orcs that try to escape.\nAfter the battle at Helm's Deep, Gandalf takes Théoden and his companions to Isengard. Where they had expected to find a wizard's stronghold, they find ruins. Merry and Pippin, left to wait at the gate, explain that the Ents have destroyed Isengard, although Saruman himself remains hidden in the impenetrable tower of Orthanc. Gandalf speaks to the fallen wizard, offering him a chance to repent. When Saruman refuses, Gandalf breaks his staff. Wormtongue, perhaps trying to hit Saruman, throws a crystal ball out the window. Later that night, Pippin sneaks a look into the stone and encounters Sauron himself. Fortunately, Gandalf breaks the contact before the hobbit has a chance to reveal Frodo's quest to destroy the Ring.\nMeanwhile, Frodo and Sam have become lost among the pathless hills of the Emyn Muil. They realize that Gollum is following them and manage to capture the corrupt creature. Despite Sam's misgivings, Frodo bargains with Gollum for guidance to the Black Gate of Mordor. Gollum agrees and leads them out of the hills and through the Dead Marshes, a haunted swamp. When they reach the Black Gate, Frodo and Sam despair of passing the constant guard but resolve to make the attempt. Gollum, however, begs them to take another way — a secret passage that only he knows. Desperate, Frodo agrees, and they turn aside from the gate.\nTraveling toward the pass of Cirith Ungol, the hobbits discover a surprisingly pleasant countryside. When they pause for a stewed rabbit dinner, however, they find themselves in the middle of a battle between an army journeying to Mordor and a company of Gondorian men. Gollum sneaks off, but the hobbits are captured by the men. The Gondorians lead them to a secret base, where they learn that the men's captain is Faramir, Boromir's younger brother. Faramir realizes their quest and their burden, but he does not attempt to take the Ring from Frodo. With Frodo's help, he does capture Gollum, an action that breaks the fragile trust that had begun to form between the two Ringbearers. Faramir advises the travelers against the path they have chosen, but he can suggest no alternative ways into Mordor.\nAfter leaving Faramir, the hobbits make their way past Minas Morgul, the home of the Black Riders. They take a hidden path into the mountains behind the fortress, a path made of steep staircases and tunnels bored through the rock. At the top of the stairs, the hobbits find themselves in a reeking tunnel clogged with tough webs. This is the lair of Shelob, a giant evil spider with an insatiable appetite. Gollum hopes to recover the Ring from the remains of Frodo and Sam, after Shelob has eaten them. With the aid of Galadriel's gift, a phial containing the pure light of elven stars, they escape Shelob's tunnel, but she attacks again from another angle and stings Frodo. Sam drives her from Frodo's fallen body, but he finds his master cold and lifeless. Nearly incapacitated by grief, Sam forces himself take the Ring from Frodo and continue the quest."
  },
  "5cf58080b53e011a64671584": {
    "summary": "To keep Pippin out of further trouble, Gandalf rides with him to Minas Tirith, the city that Sauron's armies will soon besiege. They meet with Boromir's father Denethor, the Ruling Steward of Gondor, and in gratitude for Boromir's sacrifice (saving them from the orcs at Parth Galen), Pippin pledges his service to the steward as a Guard of the White Tower. Denethor does not trust Gandalf, and he knows that the wizard has brought Aragorn to reclaim the throne. Faramir returns to the city, wearied from fighting, and reports his encounter with Frodo. Angry that his son did not bring the Ring to Gondor, Denethor sends the exhausted captain back into the field to lead a rearguard action against the oncoming army. When they make their last dash for the safety of the gates, Gandalf rides out to defend them from the flying Nazgûl, but Faramir falls at the gates.\nThe Riders of Rohan muster their forces, preparing to ride to the aid of Minas Tirith, and Merry strikes up a friendship with Théoden. Aragorn realizes that he must take the Paths of the Dead if he is to reach Minas Tirith in time to lift the siege. He takes the evil road with Legolas, Gimli, and the Dúnedain (a group of Rangers) who have joined him from the North, but the Rohirrim are convinced that he has gone to his own death. Théoden leaves behind Merry and his niece Éowyn, claiming that neither can help in the battle, but a young rider offers to carry Merry. With the aid of a strange tribesman, the Rohirrim find a forgotten road and arrive just in time to surprise the besieging army at Minas Tirith.\nAlthough small in number, the Riders of Rohan sweep across the battlefield. Then the Witchking (the most powerful Nazgûl) kills Théoden, and their charge is stopped. The rider who brought Merry to the battle reveals herself as Éowyn, and with Merry's help she slays the Enemy's greatest servant. The hopes of the city are dashed when a fleet of dark ships appears on the river, but the lead ship unfurls a banner bearing the insignia of the True King: Aragorn has arrived from the Paths of the Dead. He used his authority as the True King to call the dead themselves into battle, and they destroyed a second army that had been approaching from the river.\nInside the city, Denethor descends into madness as he watches the plight of his city and the deadly illness of Faramir. Convinced that all is lost, he orders Faramir's body carried into the mausoleum, where he plans to burn himself and his son alive. Pippin manages to find Gandalf, who saves Faramir from his father's madness, but Gandalf cannot prevent Denethor's own suicide. Faramir is taken to the Houses of Healing, as are Éowyn and Merry, and Aragorn enters the city to tend to their illness. The ability to heal is a sign of the True King, and Ioreth, one of the women in the House, recognizes Aragorn's right to the throne.\nAlthough the battle for Minas Tirith has been won, the only true victory lies with Frodo's quest. To distract Sauron from any attempt to reach Mount Doom, Aragorn leads the remaining armies of the West to the Black Gate. When they arrive, a herald from Mordor shows them Frodo's mailshirt in an attempt to make them lose heart, but the attempt at misdirection shows them that Sauron does not yet have the Ring. An enormous army attacks, and Aragorn's armies are slowly overwhelmed.\nBack in Shelob's tunnel, after taking the Ring, Sam hears a party of orcs approaching and hides from them. They find Frodo's body, and Sam learns from their conversation that Frodo is only unconscious, not dead. He rescues Frodo from the orc tower, and they begin the final stage of the journey across the desert wasteland of Mordor itself. They move slowly, hampered by thirst and the almost unbearable burden of the Ring itself, not to mention the necessity of avoiding the armies of orcs swarming the countryside. After a long struggle, they reach the slopes of Mount Doom. Gollum reappears and attacks Frodo, finally realizing that the goal of the quest has been to destroy his precious Ring. Sam holds him off long enough for Frodo to reach the Cracks of Doom. When the time comes to actually give up the Ring, Frodo cannot do it. Instead, he claims it for his own and puts it on. Instantly, Sauron sees what has happened and sends all of his power toward the mountain, including the remaining Nazgûl. Gollum is faster, however, and he struggles with Frodo on the edge of the pit. When he wrests the Ring from Frodo's hand, Gollum dances for joy and accidentally falls into the volcano, inadvertently achieving what Frodo could not do intentionally.\nFrodo and Sam are rescued by the giant eagles from the slopes of the mountain, and Aragorn himself tends their injuries. The world hails them as heroes for destroying the Ring and Sauron. Aragorn takes the throne of Gondor and marries Arwen, the daughter of Elrond. Eventually, the hobbits return home to the Shire. When they arrive, they find that the country is not the green and peaceful land they remember. A form of martial government has been instituted, and many people have been thrown into prison while others have cut down trees and polluted the countryside. Merry, Pippin, and Sam lead a revolt to reclaim the Shire, and they learn that the cause of this devastation is Saruman. Released by Treebeard, the former wizard has exacted his revenge by bringing the war home to the hobbits.\nDespite the ravages of Saruman's rule, the hobbits manage to restore the Shire to its former glory. Merry, Pippin, and Sam become prominent citizens, but Frodo remains detached and saddened, permanently damaged by his experiences with the Ring. Several years after his return home, he takes a final journey. Joining Elrond, Galadriel, Gandalf, and even Bilbo, Frodo sails with the elves to the Undying Lands, having saved the Shire for others but unable to stay there himself. Sam returns to his family in the Shire, saddened by Frodo's departure but happy with the life he has made for himself."
  }
}
